rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ship of Theseus"], ["rating", "R"], ["release_date", "2018-10-07 00:00:00.000000"], ["created_at", "2018-10-07 20:50:13.020116"], ["updated_at", "2018-10-07 20:50:13.020116"]]